["[CLS]\n", "[SEP]\n", "[PAD]\n", "[MASK]\n", ["$1\n", "admittedly\n", "amazon,\n", "another,\n", "club,\n", "company\n", "desirable\n", "dollar\n", "first\n", "join\n", "le\n", "milestone.\n", "one\n", "passed\n", "prestigious\n", "trillion\n", "valuation\n"], ["$1\n", "became\n", "bezos\u2019\n", "company\n", "everything\n", "first\n", "jeff\n", "lose\n", "market\n", "publicly\n", "store\n", "tillion\n", "traded\n", "valuation.\n", "week,\n"], ["bloomberg,\n", "boggling\n", "dour\n", "earnings\n", "economy,\n", "figures,\n", "first\n", "massive\n", "mind\n", "noted\n", "repeatedly\n", "reports,\n", "result\n", "selloffs.\n", "stock\n", "worsening\n"], ["$1.882\n", "$878\n", "21,\n", "amazon,\n", "billion\n", "comparatively\n", "june\n", "measly\n", "reported\n", "thursday\n", "trillion\n", "valuation.\n", "valued\n"], ["$900\n", "apple\n", "around\n", "behind,\n", "billion.\n", "briefly\n", "company\n", "far\n", "hovering\n", "last\n", "loss\n", "market\n", "microsoft,\n", "surpassed\n", "valuable\n", "valuation\n", "wasn\u2019t\n", "world\u2019s\n", "year,\n"], ["capture\n", "combined,\n", "companies\u2019\n", "decline\n", "effect\n", "forget.\n", "like\n", "lousy\n", "soon\n", "tech\n", "two\n", "would\n", "year\n"], ["amazon\n", "aren\u2019t\n", "decline\n", "limited\n", "microsoft.\n"], ["$4\n", "combined\n", "company\n", "five\n", "lost\n", "reportedly\n", "tech\n", "top\n", "trillion\n", "u.s.\n", "valuable\n", "value\n", "year.\n"], ["argentina,\n", "combined\n", "gdp\n", "perspective,\n", "put\n", "switzerland.\n", "that\u2019s\n", "turkey,\n"], ["advertisement\n", "amazon,\n", "disappointed\n", "expectations.\n", "failed\n", "investor\n", "last\n", "meet\n", "month\n", "particular,\n", "quarter\n", "revenue\n", "third\n"], ["2-8%.\n", "company\n", "expecting\n", "fourth\n", "growth\n", "it\u2019s\n", "over-\n", "post\n", "quarter\n", "said\n", "still,\n", "worse\n", "year\n", "year-\n"], ["amazon\n", "company,\n", "fine\n", "growth\n", "machine.\n", "normal\n", "nothing\n", "now,\n", "relentless\n", "that\u2019s\n", "there\u2019s\n", "was,\n"], ["also\n", "amazon\u2019s\n", "back\n", "begin\n", "company\n", "concerned\n", "consumers,\n", "contend\n", "covid-19,\n", "declining\n", "e\n", "e-commerce\n", "le\n", "like\n", "many\n", "retail\n", "shopping\n", "stores.\n", "trickl\n"], ["andy\n", "ceo\n", "earnings\n", "environment,\u201d\n", "following\n", "happening\n", "jassy\n", "lot\n", "macroeconomic\n", "obviously\n", "quarter\n", "report.\n", "said\n", "third\n", "\u201cthere\n"], ["amazon\u2019s\n", "avoid\n", "balance\n", "bets.\u201d\n", "compatriots.\n", "compromising\n", "eye\n", "far\n", "impacted\n", "industry\n", "investment\n", "key\n", "layoff\n", "long-term,\n", "managed\n", "many\n", "plus\n", "popping\n", "side,\n", "strategic\n", "streamlined\n", "tech\n", "we\u2019ll\n", "without\n", "\u201cand\n"], ["aren\u2019t\n", "concern.\n", "reason\n", "say\n", "that\u2019s\n"], ["company\n", "corporate\n", "cover\n", "earlier\n", "employees.\n", "expand\n", "freeze\n", "hiring\n", "month,\n", "moved\n"], ["amazon\n", "behind\n", "beth\n", "cited\n", "driver\n", "economic\n", "experience\n", "galetti\n", "hiring\n", "main\n", "memo,\n", "outlook\n", "people\n", "president\n", "recent\n", "rise\n", "senior\n", "slowdown.\n", "technology\n", "uncertain\n", "vice\n", "year\n"], ["arguably\n", "company.\n", "economy\n", "global\n", "loss\n", "modern\n", "much\n", "one\n", "out,\n", "peculiarity\n", "record\n", "say\n", "single\n", "valuation\n", "zooming\n"], ["$1\n", "achieve\n", "ago,\n", "apple\n", "became\n", "company\n", "first\n", "four\n", "mark.\n", "trillion\n", "valuation\n", "year\n"], ["amazon,\n", "apple\n", "aramco,\n", "around\n", "briefly\n", "companies,\n", "dozen\n", "figure.\n", "half\n", "including\n", "managed\n", "meta,\n", "microsoft,\n", "saudi\n", "since\n", "somehow\n", "surpass\n", "triple\n", "unfathomable\n", "valuation\n", "year\n"], ["2022,\n", "achieving\n", "amount\n", "around\n", "center\n", "company\n", "dollar\n", "level\n", "lose\n", "maintain\n", "mark,\n", "meaningful\n", "now,\n", "rather\n", "still\n", "story\n", "trillion\n", "untoward\n", "wealth.\n", "write\n"], ["(reuters)\n", "-\n", "4\n", "arabia's\n", "dec\n", "derivative\n", "dubai,\n", "efficiency.\n", "ensure\n", "exchange\n", "framework\n", "help\n", "launching\n", "liquidity\n", "market\n", "market-making\n", "price-determination\n", "raise\n", "said\n", "saudi\n", "stock\n", "sunday\n"], ["client\n", "derivative\n", "entity\n", "exchange\n", "makers.\n", "market\n", "member\n", "members,\n", "must\n"], ["\"market\n", "also\n", "availability\n", "continuous\n", "ensure\n", "exchange,\n", "known\n", "liquidity\n", "listed\n", "maker\n", "market\n", "open\n", "providing\n", "quote\n", "said.\n", "saudi\n", "security\n", "session,\"\n", "tadawul,\n", "throughout\n"], ["\"the\n", "compliance\n", "exchange\n", "incentive\n", "maker\n", "market\n", "met.\"\n", "monitor\n", "obligation\n", "obligations,\n", "provide\n", "saudi\n"], ["2\n", "3\n", "announced\n", "billion-dirham\n", "boost\n", "deepening\n", "dirhams.\n", "doubling\n", "dubai,\n", "economic\n", "fund\n", "goal\n", "last\n", "market,\n", "market-maker\n", "november\n", "rivalry,\n", "riyadh\n", "size\n", "stock\n", "trading\n", "trillion\n", "year\n"], ["abu\n", "arabia,\n", "bank\n", "capital\n", "contrast\n", "deal-making\n", "dhabi\n", "drought.\n", "dubai\n", "equity\n", "europe,\n", "global\n", "gulf,\n", "headcount\n", "helped\n", "ipo\n", "market\n", "oil-rich\n", "programme\n", "saudi\n", "sharp\n", "state\n", "state-led\n", "trimming\n", "united\n"], ["$16\n", "accounting\n", "africa,\n", "billion\n", "data\n", "east\n", "europe,\n", "gulf\n", "half\n", "ipo\n", "issuer\n", "listing\n", "middle\n", "proceeds\n", "raised\n", "refinitiv\n", "shows.\n", "total\n", "year,\n"], ["($1.32\n", "(2222.se)\n", "4.95\n", "announced\n", "aramco's\n", "base\n", "billion\n", "billion)\n", "expects\n", "giant\n", "ipo\n", "luberef\n", "oil\n", "price\n", "raise\n", "range\n", "riyal\n", "saudi\n", "subsidiary\n", "sunday.\n", "top\n"], ["agenda\n", "aimed\n", "among\n", "arabia\n", "arabia's\n", "away\n", "biggest\n", "bin\n", "broad\n", "crown\n", "diversify\n", "economic\n", "economy\n", "exchange\n", "july\n", "mohammed\n", "oil.\n", "part\n", "prince\n", "said\n", "salman\n", "saudi\n", "stock\n", "three\n", "world,\n"], ["$2.86\n", "according\n", "ahead\n", "capitalisation\n", "company\n", "exchange\n", "exchange,\n", "largest\n", "listed\n", "london\n", "market\n", "ninth\n", "october,\n", "statista.\n", "stock\n", "tadawul\n", "trillion,\n", "world's\n"], ["alexander\n", "editing\n", "principles.\n", "reporting\n", "reuters\n", "saba;\n", "smith\n", "standards:\n", "thomson\n", "trust\n", "yousef\n"], ["$10\n", "(please\n", "2022\n", "3rd,\n", "commentary\n", "enjoy\n", "newsletter).\n", "november\n", "originally\n", "powr\n", "published\n", "stock\n", "updated\n", "version\n", "weekly\n"], ["(spy)\n", "2%.\n", "500\n", "last\n", "s&p\n", "week,\n"], ["and,\n", "bear\n", "brutal\n", "end\n", "it\u2019s\n", "market\n", "rally.\n"], ["100,\n", "2\n", "better\n", "evident\n", "fact,\n", "general\n", "googl\n", "laid\n", "look\n", "market\u2019s\n", "meta.\n", "nasdaq\n", "slaughtered\n", "waste\n", "\u2013\n"], ["75%\n", "already\n", "back\n", "bear\n", "gain\n", "given\n", "index\n", "market\n", "rally.\n"], ["2000\n", "500\n", "contrast,\n", "loss\n", "much\n", "muted.\n", "russell\n", "s&p\n"], ["better\n", "continuation\n", "discussed\n", "holding\n", "last\n", "market.\n", "much\n", "stock\n", "stocks\u2019\n", "theme\n", "week\n", "\u2013\n", "\u2018market\n"], ["and,\n", "given\n", "headwind\n", "large\n", "long-term\n", "mega-cap\n", "rate\n", "rise\n", "shouldn\u2019t\n", "stocks.\n", "surprising\n"], ["(or\n", "could\n", "data\n", "economy.\n", "fed)\n", "inflation\n", "market\n", "rate\n", "relent\n", "rise\n", "saw\n", "weakness\n"], ["although\n", "case\n", "doesn\u2019t\n", "employment\n", "learn\n", "market\n", "seem\n", "state\n", "tomorrow.\n"], ["(based\n", "broad-based\n", "claims)\n", "employment\n", "far,\n", "going\n", "indication\n", "longer\u2019.\n", "mean\n", "rate\n", "truly\n", "unemployment\n", "weakness\n", "\u2018higher\n"], ["2023.\n", "bearish\n", "behind\n", "belief\n", "could\n", "early\n", "eventually\n", "fed\n", "fomc\n", "hike\n", "market\n", "one\n", "pace\n", "rally\u2019\n", "reason\n", "slowing\n", "sometime\n", "stopping\n", "term\n", "verge\n", "\u2018bear\n", "\u2018pivoting\u2019\n"], ["clear\n", "continue\n", "core\n", "doubt\n", "going\n", "hike\n", "inflation\n", "make\n", "meaningful\n", "period\n", "specifically,\n", "stubbornness\n", "time.\n", "well,\n"], ["2022\n", "back\n", "bearish.\n", "condition\n", "initial\n", "january\n", "made\n", "now,\n"], ["growth\n", "rate\n", "rising,\n", "slowing.\n"], ["cause\n", "enough\n", "fast\n", "fed\n", "growth\n", "isn\u2019t\n", "pivot.\n", "slowing\n"], ["break\n", "breaks.\n", "economy\n", "inflation\n", "keep\n", "rate\n", "rising\n", "thus,\n"], ["headwind\n", "market.\n", "potent\n", "rate\n", "rising\n", "stock\n"], ["bullish\n", "choppy\n", "conditions.\n", "get\n", "learned\n", "market\n", "nice\n", "oversold\n", "rally\n", "scenario\n", "sideways\n", "year,\n"], ["(spy)\n", "500\n", "bearish\n", "combination\n", "earnings\n", "economic\n", "front.\n", "get\n", "lower\n", "negative\n", "news\n", "plunge\n", "rate\n", "rising\n", "s&p\n", "scenario\n"], ["bout\n", "bullishness\n", "couple\n", "expect\n", "levels.\n", "lower\n", "market\n", "next\n", "over,\n", "reality\n", "set\n", "visit\n", "week\n"], ["3,600.\n", "action\n", "around\n", "back\n", "break\n", "downside\n", "includes\n", "key\n", "level\n", "low\n", "market\n", "neutral\n", "october\n", "portfolio\n", "prepared\n", "setting\n", "strategy\n", "take\n"], ["cyclical\n", "defensive\n", "downside,\n", "expect\n", "lead\n", "outperform.\n", "sector\n", "stock\n", "would\n"], ["next?\n"], ["$10,\n", "2022\n", "3\n", "become\n", "big\n", "brutal\n", "check\n", "double\n", "even\n", "free\n", "give\n", "like\n", "market?\n", "report:\n", "right\n", "see\n", "special\n", "stock\n", "stuff\n", "top\n", "winners,\n", "year\n", "you\u2019d\n"], ["company\n", "first,\n", "low\n", "markets.\n", "potential\n", "priced\n", "today\u2019s\n", "upside\n", "volatile\n"], ["according\n", "area\n", "buy\n", "coveted\n", "even\n", "excel\n", "growth,\n", "important,\n", "key\n", "momentum.\n", "powr\n", "rated\n", "rating\n", "sentiment\n", "stock\n", "system\n", "top\n"], ["3\n", "ahead.\n", "click\n", "could\n", "double\n", "exciting\n", "see\n", "stock\n", "year\n"], ["3\n", "best!\n", "double\n", "stock\n", "year\n"], ["$10\n", "$2.34\n", "$373.35\n", "(+0.63%).\n", "chief\n", "desai\n", "editor,\n", "friday\n", "growth\n", "jaimini\n", "morning,\n", "newsletter\n", "per\n", "powr\n", "share\n", "spy\n", "stock\n", "stocknews\n", "strategist,\n", "trading\n"], ["%\n", "-20.48%,\n", "500\n", "benchmark\n", "declined\n", "index\n", "period.\n", "rise\n", "s&p\n", "spy\n", "versus\n", "year-to-date,\n"], ["author:\n", "decade.\n", "desai\n", "financial\n", "jaimini\n", "nearly\n", "reporter\n", "writer\n"], ["goal\n", "help\n", "identify\n", "markets.\n", "opportunity\n", "reader\n", "risk\n"], ["$10\n", "chief\n", "editor\n", "growth\n", "newsletters.\n", "powr\n", "stock\n", "stocknews.com\n", "strategist\n"], ["along\n", "articles.\n", "background,\n", "jaimini\u2019s\n", "learn\n", "link\n", "recent\n"], ["article\n", "more...\n", "resource\n", "stock\n"]]