["[CLS]\n", "[SEP]\n", "[PAD]\n", "[MASK]\n", ["investors.\n", "it\u2019s\n", "time\n", "year\n"], ["ahead.\n", "behind\n", "focus\n", "lie\n", "order\n", "past\n", "put\n", "u\n", "year\n"], ["&\n", "2023\n", ">\n", "expect\n", "hyde\u201d\n", "led\n", "market\n", "now:\n", "outlook\n", "plan\n", "presentation\n", "prices.\n", "record\n", "stock\n", "timely\n", "trading\n", "truly\n", "watch\n", "year\n", "\u201cjekyll\n"], ["2023\n", "bear\n", "deeper\n", "early\n", "fade\n", "fast\n", "finding\n", "impressive\n", "look\n", "low\n", "market.\n", "matter\n", "meaning\n", "newer\n", "rally\n", "recent\n"], ["8\n", "down.\n", "help\n", "pick\n", "plan\n", "profit\n", "specific\n", "trading\n", "way\n"], ["bull\n", "darkest\n", "emerges\n", "gains.\n", "hour\n", "market\n", "new\n", "tremendous\n", "ushering\n"], ["best\n", "come\n", "decade.\n", "late\n", "miss\n", "party\n", "return\n"], ["bear\n", "bottom\n", "bull\n", "emerges.\n", "enjoy\n", "finding\n", "gladly\n", "market\n", "new\n", "plan\n", "profit\n", "serious\n", "trading\n"], ["100%+\n", "2\n", "2023.\n", "detail\n", "includes\n", "pick\n", "potential\n", "stellar\n", "upside\n"], ["ahead\n", "investing\n", "now.\n", "plan\n", "prepare\n", "start\n", "time\n", "year\n"], ["2023\n", ">\n", "below:\n", "first\n", "investment\n", "journey\n", "market\n", "outlook\n", "presentation\n", "shared\n", "start\n", "step\n", "stock\n", "success!\n", "timely\n", "watching\n", "wishing\n", "world\n"], ["$0.43\n", "(-0.11%)\n", "(pronounced\n", "after-hours\n", "call\n", "ceo,\n", "editor,\n", "everyone\n", "fell\n", "friday.\n", "network\n", "news\n", "reitmeister\n", "reitmeister\u2026but\n", "reity\n", "return\n", "share\n", "spy\n", "steve\n", "stock\n", "total\n", "trading\n", "\u201crighty\u201d)\n"], ["%\n", "-16.24%,\n", "500\n", "benchmark\n", "declined\n", "index\n", "period.\n", "rise\n", "s&p\n", "spy\n", "versus\n", "year-to-date,\n"], ["audience\n", "author:\n", "better\n", "known\n", "reitmeister\n", "steve\n", "stocknews\n", "\u201creity\u201d.\n"], ["40\n", "also\n", "ceo\n", "experience\n", "firm,\n", "investment\n", "portfolio.\n", "reitmeister\n", "return\n", "share\n", "total\n", "year\n"], ["along\n", "article\n", "background,\n", "learn\n", "link\n", "picks.\n", "recent\n", "reity\u2019s\n", "stock\n"], ["article\n", "more...\n", "resource\n", "stock\n"], ["(reuters)\n", "-\n", "4\n", "arabia's\n", "dec\n", "derivative\n", "dubai,\n", "efficiency.\n", "ensure\n", "exchange\n", "framework\n", "help\n", "launching\n", "liquidity\n", "market\n", "market-making\n", "price-determination\n", "raise\n", "said\n", "saudi\n", "stock\n", "sunday\n"], ["client\n", "derivative\n", "entity\n", "exchange\n", "makers.\n", "market\n", "member\n", "members,\n", "must\n"], ["\"market\n", "also\n", "availability\n", "continuous\n", "ensure\n", "exchange,\n", "known\n", "liquidity\n", "listed\n", "maker\n", "market\n", "open\n", "providing\n", "quote\n", "said.\n", "saudi\n", "security\n", "session,\"\n", "tadawul,\n", "throughout\n"], ["\"the\n", "compliance\n", "exchange\n", "incentive\n", "maker\n", "market\n", "met.\"\n", "monitor\n", "obligation\n", "obligations,\n", "provide\n", "saudi\n"], ["2\n", "3\n", "announced\n", "billion-dirham\n", "boost\n", "deepening\n", "dirhams.\n", "doubling\n", "dubai,\n", "economic\n", "fund\n", "goal\n", "last\n", "market,\n", "market-maker\n", "november\n", "rivalry,\n", "riyadh\n", "size\n", "stock\n", "trading\n", "trillion\n", "year\n"], ["abu\n", "arabia,\n", "bank\n", "capital\n", "contrast\n", "deal-making\n", "dhabi\n", "drought.\n", "dubai\n", "equity\n", "europe,\n", "global\n", "gulf,\n", "headcount\n", "helped\n", "ipo\n", "market\n", "oil-rich\n", "programme\n", "saudi\n", "sharp\n", "state\n", "state-led\n", "trimming\n", "united\n"], ["$16\n", "accounting\n", "africa,\n", "billion\n", "data\n", "east\n", "europe,\n", "gulf\n", "half\n", "ipo\n", "issuer\n", "listing\n", "middle\n", "proceeds\n", "raised\n", "refinitiv\n", "shows.\n", "total\n", "year,\n"], ["($1.32\n", "(2222.se)\n", "4.95\n", "announced\n", "aramco's\n", "base\n", "billion\n", "billion)\n", "expects\n", "giant\n", "ipo\n", "luberef\n", "oil\n", "price\n", "raise\n", "range\n", "riyal\n", "saudi\n", "subsidiary\n", "sunday.\n", "top\n"], ["agenda\n", "aimed\n", "among\n", "arabia\n", "arabia's\n", "away\n", "biggest\n", "bin\n", "broad\n", "crown\n", "diversify\n", "economic\n", "economy\n", "exchange\n", "july\n", "mohammed\n", "oil.\n", "part\n", "prince\n", "said\n", "salman\n", "saudi\n", "stock\n", "three\n", "world,\n"], ["$2.86\n", "according\n", "ahead\n", "capitalisation\n", "company\n", "exchange\n", "exchange,\n", "largest\n", "listed\n", "london\n", "market\n", "ninth\n", "october,\n", "statista.\n", "stock\n", "tadawul\n", "trillion,\n", "world's\n"], ["alexander\n", "editing\n", "principles.\n", "reporting\n", "reuters\n", "saba;\n", "smith\n", "standards:\n", "thomson\n", "trust\n", "yousef\n"], ["(reuters)\n", ",\n", "-\n", "20\n", "asx\n", "australian\n", "clearing\n", "conference\n", "dec\n", "exchange,\n", "head\n", "hear.\n", "hogben,\n", "hoping\n", "hotel\n", "house\n", "ltd\n", "may,\n", "operator\n", "payment\n", "registry\n", "representative\n", "room\n", "run\n", "security\n", "share\n", "stock\n", "sydney\n", "sydney,\n", "tim\n", "told\n", "traders,\n"], ["aggressively\n", "aging\n", "asx\n", "blockchain-based\n", "boost\n", "compete\n", "development,\n", "enable\n", "exchange's\n", "global\n", "largely\n", "putting\n", "ready\n", "rebuild\n", "rivals.\n", "seven\n", "software\n", "technology\n", "trading\n", "transformation\n", "using\n", "verge\n", "volume\n", "world-first\n", "would\n", "year\n"], ["\"ninety-six\n", "currently\n", "environment.\n", "operating-and-test\n", "percent\n", "software\n"], ["96%\n", "adviser\n", "association\n", "conference,\n", "footage\n", "hogben\n", "investment\n", "reuters.\n", "seen\n", "software\n", "stockbroker\n", "told\n", "working,\"\n"], ["\"if\n", "hearing\n", "it,\n", "let\n", "tell\n", "working,\n", "you.\"\n"], ["abandoned\n", "asx\n", "citing\n", "complexity\n", "concern\n", "difficulty\n", "dysfunctional\n", "expert\n", "finding\n", "it.\n", "management,\n", "november,\n", "product's\n", "project,\n", "scalability,\n", "support\n"], ["63%\n", "accenture\n", "almost\n", "axing\n", "came\n", "ceo\n", "code\n", "commissioned\n", "delivered\n", "found\n", "half\n", "helen\n", "lofthouse\n", "needed\n", "new\n", "rebuild\n", "review\n", "rewritten.\n"], ["australian\n", "blockchain\n", "brokers,\n", "directly\n", "dozen\n", "exchange\n", "failure\n", "involved\n", "market\n", "operator.\n", "participant\n", "people\n", "project\n", "reuters\n", "shaken\n", "told\n", "trust\n"], ["2020\n", "assurance\n", "asx's\n", "contributed\n", "cost\n", "delay\n", "dismay\n", "doomed\n", "endeavour\n", "expressed\n", "faced\n", "five\n", "initially\n", "launch.\n", "repeat\n", "scheduled\n", "since\n", "time\n", "upgrade,\n", "well\n"], ["also\n", "cryptocurrencies.\n", "experience\n", "mismatch\n", "promise\n", "question\n", "raised\n", "reality\n", "technology\n", "underpins\n"], ["application\n", "australia's\n", "blockchain-based\n", "corporate\n", "critical\n", "distributed\n", "financial\n", "infrastructure\n", "ledger\n", "mainstream\n", "one\n", "setting.\n", "significant\n", "system\n", "use\n", "would\n"], ["\"the\n", "(but)\n", "asx\n", "australia,\n", "bleeding\n", "cboe\n", "chose\n", "chosen\n", "clearing\n", "could\n", "counsel\n", "cutting\n", "derivative\n", "edge\n", "edge,\n", "exchange\n", "general\n", "involved\n", "michael\n", "project.\n", "said\n", "security\n", "settlement\n", "somes,\n", "stable\n", "steady\n", "system\n", "technology\n", "unproven,\n", "untried,\"\n"], ["\"asx's\n", "biggest\n", "choice\n", "critical\n", "financial\n", "globally.\"\n", "market\n", "one\n", "resulted\n", "seen\n", "service\n", "stuff-ups\n"], ["($164-171\n", "a$245-a$255\n", "airfare\n", "asx\n", "attending\n", "charge\n", "consultations.\n", "debacle,\n", "employee\n", "estimate\n", "hour\n", "including\n", "market\n", "million\n", "million)\n", "plan\n", "player\n", "preparing\n", "rollout,\n", "software\n", "spent\n", "take\n", "together\n", "top\n", "upgrades,\n", "webinars\n"], ["apologised\n", "asx\n", "denied\n", "failure\n", "hearing\n", "market\n", "misleading\n", "month,\n", "parliamentary\n", "regulators.\n"], ["\"functional\"\n", "\"moved\n", "\"non-functional\"\n", "2021\n", "annual\n", "asked\n", "build\n", "chairman\n", "claim\n", "company's\n", "damian\n", "delivery\",\n", "design\n", "lawmaker\n", "like\n", "part\n", "phase\n", "project\n", "referred\n", "report\n", "roche,\n", "said\n", "scalability.\n", "security\n", "software,\n", "statement\n", "testing\n"], ["\"only\n", "apparent\n", "asx\n", "available\n", "based\n", "became\n", "challenge\n", "company\n", "email\n", "gave\n", "information\n", "latest\n", "latter\n", "project\n", "reached\n", "reuters\n", "spokesperson\n", "stages\".\n", "told\n", "update\n"], ["2015,\n", "asx's\n", "began\n", "blockchain.\n", "chess,\n", "clearing\n", "creep\n", "cryptocurrency\n", "electronic\n", "elmer\n", "facilitates\n", "fascination\n", "funke\n", "global\n", "house\n", "known\n", "kupper\n", "platform\n", "quest\n", "replace\n", "scope\n", "subregister\n", "system\n", "then-ceo\n", "trade\n", "\u2014\n"], ["2016\n", "asset\n", "asx\n", "begin\n", "blockchain\n", "company\n", "digital\n", "early\n", "executive\n", "exploratory\n", "holding\n", "little-known\n", "new\n", "overhaul.\n", "showed\n", "signed\n", "software,\n", "startup\n", "test\n", "transaction\n", "work\n", "york\n"], ["5%\n", "asset.\n", "asx\n", "bought\n", "digital\n", "stake\n"], ["allegation\n", "bribery\n", "cleared.\n", "funke\n", "kupper\n", "later\n", "month\n", "previous\n", "quit\n", "relating\n", "role;\n", "two\n"], ["8.5%.\n", "asset\n", "asx\n", "digital\n", "holding\n", "pressed\n", "raised\n", "rebuild,\n"], ["anonymity\n", "concern\n", "condition\n", "consultation\n", "consultation,\n", "dominic\n", "exchange\n", "extensive\n", "funke\n", "involved\n", "kupper's\n", "market\n", "operator\n", "person\n", "professional\n", "project\n", "repercussions.\n", "reuters\n", "stevens,\n", "successor,\n", "told\n", "went\n"], ["also\n", "scope\n", "widened.\n"], ["12\n", "400\n", "asx\n", "blockchain,\n", "chess's\n", "data\n", "decided\n", "include\n", "initial\n", "new\n", "per\n", "person\n", "plan\n", "run\n", "said.\n", "system\n", "transaction\n", "transfer\n", "transfers,\n", "would\n"], ["adding\n", "after-market\n", "asset\n", "asx\n", "company\n", "concern\n", "digital\n", "enlisted\n", "lacked\n", "people\n", "person\n", "product\n", "project\n", "raised\n", "said,\n", "scalability,\n", "support\n", "testing\n", "unaddressed.\n", "went\n", "without\n", "working\n", "worry\n"], ["300\n", "asx\n", "chess\n", "headcount.\n", "one-third\n", "people\n", "project,\n", "replacement\n", "ultimately,\n", "working\n"], ["\"to\n", "allocated\n", "asx\n", "australia\n", "consultation\n", "director\n", "every\n", "four\n", "managing\n", "morrison\n", "partly\n", "pretty\n", "project\n", "put\n", "said\n", "securities,\n", "several\n", "slack,\n", "something\n", "staff\n", "tested\n", "that's\n", "think\n", "three\n", "tried\n", "try\n", "two\n", "unwise,\"\n", "william\n", "years.\n"], ["comment.\n", "funke\n", "kupper\n", "request\n", "respond\n"], ["effort\n", "reach\n", "stevens\n", "successful.\n"], ["\"the\n", "announced\n", "australian\n", "blockchain\n", "delivered\n", "february,\n", "financial\n", "find\n", "next\n", "over\".\n", "project\n", "retirement\n", "review\n", "stage\n", "successor\n", "swap\n", "told\n", "working,\n", "would\n"], ["1994,\n", "chess\n", "clearing\n", "combined\n", "innovative\n", "live\n", "one\n", "platform.\n", "seen\n", "settlement\n", "trading,\n", "went\n"], ["became\n", "harder\n", "maintain.\n", "outdated\n", "time\n"], ["\"with\n", "2020\n", "australia\n", "bank\n", "cap\n", "chess\n", "critical\".\n", "delays,\n", "led\n", "march\n", "modern\n", "processing\n", "regulator\n", "replacing\n", "reserve\n", "said\n", "surge\n", "technology\n", "trade\n", "trading\n"], ["advantage\n", "asx\n", "blockchain,\n", "chess\n", "contact\n", "function\n", "involved\n", "people\n", "point\n", "processing,\n", "project\n", "reduce\n", "replicate\n", "risked\n", "said.\n", "seeking\n", "single\n", "slow\n", "system,\n", "undermining\n", "yet\n"], ["\"it\n", "asx\n", "aziz,\n", "blockchain,\"\n", "budgets,\n", "build\n", "chess\n", "chief\n", "easier,\n", "financial\n", "former\n", "governance\n", "guess,\n", "initial\n", "language,\n", "modern\n", "new\n", "officer\n", "oversaw\n", "project\n", "ramy\n", "rather\n", "related\n", "said\n", "stages.\n", "timetable\n", "version\n", "would\n"], ["\"maybe\n", "bit\n", "blockchain\n", "capable\n", "chess.\n", "develop\n", "need\n", "want\n"], ["able\n", "it'll\n", "it.\"\n", "maybe\n", "never\n"], ["\"the\n", "(and)\n", "accenture's\n", "agreeing\n", "asset\n", "beyond\n", "business\n", "comment\n", "consistent\n", "declined\n", "design\".\n", "digital\n", "highlighted\n", "need\n", "part\n", "report\n", "requirement\n", "simplification\n", "solution\n", "statement\n", "website\n"], ["\"clear\n", "alignment\n", "criterion\n", "defined\n", "manageable\n", "milestone\n", "objective\n", "paramount,\"\n", "requirements,\n", "said.\n", "success\n"], ["\"robust\n", "asset\n", "asx\n", "chose\n", "company\n", "could\n", "digital\n", "distributed\n", "global\"\n", "ledger\n", "reuters\n", "search.\n", "spokesperson\n", "technology\n", "told\n", "transformational\n"], ["a.p.\n", "asx\n", "project,\n", "shelved\n", "soon\n"], ["(ibm.n)\n", "(maerskb.co)\n", "a/s\n", "blockchain-enabled\n", "citing\n", "cooperation.\n", "ended\n", "global\n", "ibm\n", "lack\n", "moeller-maersk\n", "platform,\n", "shipping\n"], ["fallout\n", "recrimination\n", "swift.\n"], ["\"unsatisfactory\"\n", "\"very\n", "asx\n", "australia\n", "australian\n", "bank\n", "belated\n", "called\n", "chess,\n", "commission\n", "commission,\n", "demanded\n", "disappointing\".\n", "disclosure\n", "exchange,\n", "explaining\n", "failure\n", "investment\n", "plan\n", "problem\n", "regulates\n", "report\n", "reserve\n", "security\n", "special\n"], ["asic's\n", "asx.\n", "expand\n", "lawmaker\n", "power\n", "want\n"], ["10%,\n", "analyst\n", "asx\n", "citing\n", "cut\n", "morgan\n", "share\n", "stanley\n", "strategic\n", "uncertainties.\n", "valuation\n"], ["asx\n", "compensation\n", "lost\n", "meanwhile,\n", "money\n", "of.\n", "opt\n", "project\n", "say\n", "time\n", "users,\n", "want\n"], ["\"the\n", "accurate,\n", "announcement\n", "asx\n", "brisbane\n", "brokerage.\n", "certainly\n", "client\n", "come\n", "daniel\n", "director\n", "journey\n", "might\n", "misleading,\"\n", "morgans,\n", "public\n", "said\n", "say\n", "service\n", "shown\n", "spokes,\n", "support\n"], ["\"have\n", "compensation\",\n", "invested\n", "right\n", "said.\n", "sort\n", "technology\n", "vendor\n"], ["a$1\n", "anonymity\n", "asx's\n", "avoid\n", "broker\n", "ceo\n", "condition\n", "cost\n", "developer\n", "employed\n", "exchange,\n", "four\n", "frequent\n", "full-time\n", "harming\n", "keep\n", "million,\n", "relation\n", "requirements.\n", "reuters\n", "run\n", "small\n", "software\n", "software,\n", "spoke\n", "three\n", "told\n", "trading\n", "update\n", "years,\n"], ["asic\n", "associated\n", "asx\n", "cover\n", "expect\n", "failure.\n", "industry\n", "rba\n", "said\n", "write-down\n"], ["\"very\n", "(and)\n", "already\n", "asx\n", "aware\n", "bear\n", "company\n", "consider\n", "customer\n", "investment\n", "leveraged\n", "made\n", "mind\n", "new\n", "said\n", "solution\".\n", "spokesperson\n", "stakeholder\n", "work\n"], ["\"offered\n", "added,\n", "customer\n", "elaborating.\n", "exchange\n", "past\",\n", "rebate\n", "spokesperson\n", "without\n"], ["cost\n", "firms,\n", "hard\n", "measure.\n"], ["2021\n", "abortive\n", "asx\n", "based\n", "biggest\n", "bought\n", "changeover\n", "company\n", "date.\n", "finclear\n", "integrating\n", "ltd,\n", "one\n", "postponed\n", "providers,\n", "pty\n", "software\n", "system\n", "third-party\n", "trading\n"], ["\"it's\n", "around\n", "ceo\n", "david\n", "decision-making\n", "ferrall.\n", "finclear\n", "interconnected,\"\n", "meant\n", "process\n", "project\n", "said\n", "technology\n", "term\n"], ["\"asx\n", "deliberately,\n", "inadvertently\n", "market.\n", "misled\n", "probably,\n", "whether\n"], ["i'd\n", "inadvertently.\"\n", "like\n", "think\n"], ["\"and\n", "burrell\n", "burrell,\n", "came\n", "chris\n", "date\n", "delayed\n", "director\n", "employee\n", "got\n", "launch\n", "learning\n", "managing\n", "out\".\n", "project's\n", "pushed\n", "retirement\n", "said\n", "schedule,\n", "stockbroking,\n"], ["aftermath,\n", "asx\n", "core\n", "determine\n", "must\n", "platform.\n", "still\n", "update\n"], ["\"no\n", "australian\n", "available\n", "market\".\n", "meet\n", "need\n", "off-the-shelf\n", "reuters\n", "solution\n", "spokesperson\n", "told\n"], ["aziz\n", "carefully\n", "exchange\n", "next\n", "predicted\n", "tread\n", "try.\n", "would\n"], ["\"they'll\n", "blockchain,\"\n", "build\n", "chess\n", "go\n", "language,\n", "new\n", "normal\n", "probably\n", "programming\n", "said.\n", "version\n", "within\n"], ["\"that's\n", "really.\"\n"], ["byron\n", "crawshaw\n", "david\n", "editing\n", "kaye;\n", "principles.\n", "reporting\n", "reuters\n", "standards:\n", "thomson\n", "trust\n"]]